{
  "Router": {
    "Home": "Strona główna",
    "Experience": "Doświadczenie",
    "Repositories": "Repozytoria",
    "Hobbies": "Zainteresowania",
    "About": "Informacje"
  },
  "HomeView" : {
    "toolbar_title": "Rafał Szygenda - Osobista strona internetowa",
    "welcome": "Witam na mojej stronie!",
    "welcome_text": "Na tej stronie znajdziesz informacje o mnie",
    "theme_tooltip": "Kliknij aby zmienić kolor tła",
    "language_tooltip": "Kliknij aby zmienić język",
    "view_card_button_text": "Przejdź do strony",
    "options_text": "W górnej częsci strony możesz przejść przez szufladę nawigacyjną do pozostałych stron, zmienić tło i język strony",
    "Views_card_descriptions": {
      "Home": "Tutaj się znajdujesz :)",
      "Experience": "Moje wykształcenie oraz doświadczenie zawodowe",
      "Repositories": "Moje publiczne repozytoria z Github",
      "Hobbies": "Trochę o mnie i o tym co robię w wolnym czasie",
      "About": "Informacje o projekcie i wykorzystywanych technologiach"
    }
  },
  "RepositoriesView" : {
    "Repositories_fetching_error" : "Podczas zbierania danych o repozytoriach wystąpił błąd. Spróbuj ponownie",
    "Repository_languages_error": "Podczas zbierania danych o repozytorium wystąpił błąd. Spróbuj ponownie.",
    "Repository_default_license_text" : "Brak licencji"
  },
  "LanguangeChangeDialogue" : {
    "title": "Wybierz Język",
    "close_dialog": "Zamknij",
    "languages": {
      "pl": "Polski",
      "en": "Angielski"
    }
  },
  "Footer": {
    "text": "Znajdź mnie tutaj"
  },
  "AboutView" : {
    "title": "Informacje o projekcie",
    "info_text": "Ta strona jest na ten moment moim webowym CV. W przyszłości, jeśli będzie potrzeba, będę rozwijać te stronę :).",
    "technologies": "Technologie i funkcjonalności",
    "technologies_text": [
      {
        "technology": "Vue 3.0 composition API",
        "description": "Composition API w Vue 3.0 to nowy sposób definiowania komponentów w aplikacjach Vue, który wprowadza bardziej elastyczne i modularne podejście w porównaniu do tradycyjnej opcji API. Pozwala na łatwiejsze zarządzanie stanem, logiką i ponownym użyciem kodu w różnych komponentach.",
        "icon": "mdi-vuejs"
      },
      {
        "technology": "Vuetify",
        "description": "Vuetify to popularna biblioteka komponentów UI oparta na Vue.js, która oferuje szeroki zestaw gotowych komponentów zgodnych z zasadami Material Design. Umożliwia szybkie tworzenie nowoczesnych i responsywnych interfejsów użytkownika.",
        "icon": "mdi-vuetify"
      },
      {
        "technology": "Vue router",
        "description": "Vue Router to oficjalna biblioteka routingu dla Vue.js, która pozwala na tworzenie aplikacji wielostronicowych poprzez zarządzanie trasami i komponentami w aplikacji. Obsługuje dynamiczne ładowanie stron, parametry URL i wiele więcej.",
        "icon": "mdi-vuejs"
      }
    ]
  },
  "ExperienceView": {
    "Professional experience": {
      "title": "Doświadczenie zawodowe",
      "icon": "mdi-briefcase-outline",
      "Volkswagen Poznan  - Praktyki": {
        "timestamp": "2024-08/2024-09",
        "bullet_points": [
          "Zaprojektowałem i wdrożyłem aplikację internetową przy użyciu Vue.js do wizualizacji animacji robotów przemysłowych. Aplikacja zawierała interfejs odtwarzania, umożliwiający użytkownikom przeglądanie danych z określonego okresu czasu i obserwowanie odpowiadających im animacji ruchu robotów. Zaimplementowałem płynną integrację wizualizacji danych opartej na czasie z precyzyjną symulacją ruchu robotów, zapewniając intuicyjne i interaktywne doświadczenie w monitorowaniu i analizowaniu operacji robotycznych.",
          "Zaprojektowałem i ulepszyłem istniejące rozwiązania internetowe, tworząc nowe i modyfikując istniejące punkty końcowe Django REST API podłączone do bazy danych MySQL. Te punkty końcowe umożliwiały zarządzanie i pobieranie szczegółowych zapisów wymian produkcyjnych, zapewniając efektywne przetwarzanie danych i integrację z istniejącym systemem.",
          "Współpracowałem z zespołem 3 inżynierów przy projektowaniu rozwiązań programistycznych, wykorzystując Git do kontroli wersji i koordynacji projektu."
        ]
      },
      "Volkswagen Poznan - Praktyki Projektowe": {
        "timestamp": "2024-11/Teraz",
        "bullet_points": [
          "Zaprojektowałem i opracowałem aplikację internetową z Vue.js do wizualizacji modeli 3D i animacji, przestrzegając wytycznych UX/UI, aby zapewnić przyjazny i atrakcyjny interfejs użytkownika.",
          "Współpracowałem z zespołem 5 inżynierów, korzystając z Git i Jira do kontroli wersji, zarządzania zadaniami i koordynacji projektu.",
          "Ulepszyłem i zoptymalizowałem metody w Django REST API, poprawiając wydajność backendu i niezawodność systemu.",
          "Analizowałem dane robotów, aby ocenić szybkość transmisji informacji w systemie i zapewnić prawidłowe funkcjonowanie robotów, przyczyniając się do efektywności i solidności systemu."
        ]
      }
    },
    "University experience": {
      "title": "Doświadczenie akademickie",
      "icon": "mdi-school-outline",
      "PUT Poznan": {
        "timestamp": "2021-10/Teraz",
        "bullet_points": [
          "[Podstawy informatyki]: Podstawy programowania i baz danych, C++, Winforms i MySQL",
          "[Programowanie strukturalne i obiektowe]: Programowanie obiektowe, algorytmy, struktury danych przy użyciu C++",
          "[Metody numeryczne i symulacje]: Metody numeryczne i symulacje z wykorzystaniem C++ i Matlab",
          "[Modelowanie i sterowanie robotami]: Podstawy bibliotek ROS i symulacje robotyki przy użyciu Linux, Python",
          "[Wprowadzenie do wizji komputerowej]: Przetwarzanie obrazów, przemysłowe systemy wizji komputerowej i podstawy deep learning",
          "[Systemy mikroprocesorowe]: Aplikacje wbudowane przy użyciu C",
          "[Aplikacje mobilne]: Tworzenie dostępnych aplikacji przy użyciu Android Studio, Kotlin",
          "[Systemy czasu rzeczywistego]: Wielowątkowe aplikacje wbudowane przy użyciu FreeRTOS, arduino. Wielowątkowość w C++"
        ]
      },
      "Simuthon 2023": {
        "bullet_points": [
          "Rozwiązałem zadanie optymalizacji ścieżki, używając algorytmu A* z niestandardową funkcją kosztu",
          "Pomogłem w refaktoryzacji kodu w innych zadaniach"
        ]
      }
    }
  }
}
